---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarBendingDetail
source: html/c7a2120d-5a13-f723-c8e8-e9c5e6d3e46e.htm
---
# RebarBendingDetail Methods

Creates a new instance of a bending detail.